In [2]:
import pandas as pd

In [22]:
# creating  dataframe 
data={'name':['alice','ram','bob'],'age':[22,23,24]}
df=pd.DataFrame(data)
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [23]:
print(df)

    name  age
0  alice   22
1    ram   23
2    bob   24

In [15]:
data=([1,2],['a','b'],['c','d'])
df1=pd.DataFrame(data,columns=['name','age'])
print(df1)

  name age
0    1   2
1    a   b
2    c   d

In [13]:
#df1.columns=['name','age']

In [16]:
df1.columns

Index(['name', 'age'], dtype='object')

## accessing the data

In [24]:
df['name']

0    alice
1      ram
2      bob
Name: name, dtype: object

In [26]:
type(df['name'])

pandas.core.series.Series

In [28]:
df[['name','age']]

    name  age
0  alice   22
1    ram   23
2    bob   24

In [37]:
print(df['age']>22)

0    False
1     True
2     True
Name: age, dtype: bool

In [39]:
df['age'] > 22

0    False
1     True
2     True
Name: age, dtype: bool

In [40]:
df[df['age']>22]

  name  age
1  ram   23
2  bob   24

In [45]:
df[df['name'].str.startswith('b')&(df['age']>20)]

  name  age
2  bob   24

In [47]:
df[df['name'].str.startswith('b')&(df['age']>20)]

  name  age
2  bob   24

In [50]:
df[df['age'].isnull()]

Empty DataFrame
Columns: [name, age]
Index: []

In [53]:
df.loc[1]

name    ram
age      23
Name: 1, dtype: object

In [52]:
df.loc[0,'name']

'alice'

In [57]:
df.loc[0:1,['name','age']]

    name  age
0  alice   22
1    ram   23

In [58]:
df.loc[0:1,'name':'age']

    name  age
0  alice   22
1    ram   23

In [56]:
df.loc[0:1]

    name  age
0  alice   22
1    ram   23

In [59]:
df.iloc[0,0]

'alice'

In [60]:
df.iloc[0:1,[0,1]]

    name  age
0  alice   22

In [63]:
df.iloc[0:2,]

    name  age
0  alice   22
1    ram   23

In [66]:
df.at[0,'name']

'alice'

## reading and writing file

In [72]:
df=pd.read_csv('data.csv')

In [73]:
df

    name  age
0  Alice   25
1    Bob   30

In [75]:
df.loc[0,'name']

'Alice'

In [79]:

df.loc[2,'age']=30
df.loc[2,'name']='rita'

In [80]:
df.loc[2,'age']

30.0

In [81]:
df

    name   age
0  Alice  25.0
1    Bob  30.0
2   rita  30.0

In [82]:
df.to_csv('data.csv',index=False)

In [83]:
df

    name   age
0  Alice  25.0
1    Bob  30.0
2   rita  30.0